# ElectricalDemandFactorValue Constructor (Double, Double, Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorValue Constructor (Double, Double, Double)
ElectricalDemandFactorValue Class See Also
---
Constructor. Initializes factor, minimum range and maximum range to values passed in.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElectricalDemandFactorValue(
	double minRange,
	double maxRange,
	double factor
)
```

Visual Basic
---
```text
Public Sub New ( _
	minRange As Double, _
	maxRange As Double, _
	factor As Double _
)
```

Visual C++
---
```text
public:
ElectricalDemandFactorValue(
	double minRange,
	double maxRange,
	double factor
)
```

# ### Parameters
minRange
    Type: System..::..Double
maxRange
    Type: System..::..Double
factor
    Type: System..::..Double
# See Also
ElectricalDemandFactorValue Class
ElectricalDemandFactorValue Overload
Autodesk.Revit.DB.Electrical Namespace